In [2]:
pip install numpy

Requirement already satisfied: numpy in c:\users\rhomb\appdata\local\programs\python\python313\lib\site-packages (2.2.1)
Note: you may need to restart the kernel to use updated packages.

In [1]:
pip install pandas

Collecting pandasNote: you may need to restart the kernel to use updated packages.

  Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\rhomb\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rhomb\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\rhomb\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   --- ------------------------------------ 1.0/11.5 MB 6.7 MB/s eta 0:00:02
   -------- ------------------------------- 2.4/11.5 MB 6.1 MB/s eta 0:00:02
   -------------- ------------------------- 4.2/11.5 MB 6.8 MB/s eta 0:00:02
   -------------------- ------------------- 5.8/11.5 MB 7.0 MB/s eta 0:00:01
   ------------------------- -------------- 7.3/11.5 MB 7.1 MB/s eta 0:00:01
   ------------------------------- -------- 9.2/11.5 MB 7.4 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 7.7 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 7.5 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2

In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.3'

In [8]:
s=pd.Series([3, -5, 7, 4],index=['a','b','c','d'])
print(s)
print(type(s))

a    3
b   -5
c    7
d    4
dtype: int64
<class 'pandas.core.series.Series'>

In [11]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [12]:
s.values

array([ 3, -5,  7,  4])

In [15]:
print(s[0]) # 앞으로 이렇게 안할예정 -> ser.iloc[pos] 사용 공지지

3

C:\Users\rhomb\AppData\Local\Temp\ipykernel_11048\287792665.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])

In [17]:
print(s['a'])

3

In [18]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [19]:
s*3

a     9
b   -15
c    21
d    12
dtype: int64

In [30]:
df = pd.DataFrame({'Division':['부산광역시','전라남도','강원도'],
                  'Code':['051','061','033'],
                  'Population':['3364358','1840921','1535530']})
df
print(df)
print(type(df))
display(df)

  Division Code Population
0    부산광역시  051    3364358
1     전라남도  061    1840921
2      강원도  033    1535530
<class 'pandas.core.frame.DataFrame'>

  Division Code Population
0    부산광역시  051    3364358
1     전라남도  061    1840921
2      강원도  033    1535530

In [31]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [32]:
df.columns

Index(['Division', 'Code', 'Population'], dtype='object')

In [33]:
df.values

array([['부산광역시', '051', '3364358'],
       ['전라남도', '061', '1840921'],
       ['강원도', '033', '1535530']], dtype=object)

In [35]:
df

  Division Code Population
0    부산광역시  051    3364358
1     전라남도  061    1840921
2      강원도  033    1535530

In [37]:
df.info()
#non-null  count : null이 없다. = 데이트가 있다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Division    3 non-null      object
 1   Code        3 non-null      object
 2   Population  3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [38]:
df.set_index('Division')

         Code Population
Division
부산광역시     051    3364358
전라남도      061    1840921
강원도       033    1535530

In [45]:
ap = pd.read_csv('heroes.csv')
ap

      이름  나이     직업     국적    키            재산
0   아이언맨  58    CEO     미국  174  1.150000e+10
1     토르  45      신  아스가르드  190           NaN
2  스파이더맨  18   고등학생     미국  177  6.000000e+02
3   원더우먼  27     공주  데미스키라  178           NaN
4     헐크  33  핵물리학자     미국  270  1.000000e+09
5   캡틴마블  25    파일럿     미국  170  3.400000e+08
6  블랙위도우  32    스파이    러시아  170  5.000000e+07

In [46]:
ap.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   직업      7 non-null      object
 3   국적      7 non-null      object
 4   키       7 non-null      int64
 5   재산      5 non-null      float64
dtypes: float64(1), int64(2), object(3)
memory usage: 468.0+ bytes

In [47]:
ap.head()

      이름  나이     직업     국적    키            재산
0   아이언맨  58    CEO     미국  174  1.150000e+10
1     토르  45      신  아스가르드  190           NaN
2  스파이더맨  18   고등학생     미국  177  6.000000e+02
3   원더우먼  27     공주  데미스키라  178           NaN
4     헐크  33  핵물리학자     미국  270  1.000000e+09

In [48]:
ap.tail()

      이름  나이     직업     국적    키            재산
2  스파이더맨  18   고등학생     미국  177  6.000000e+02
3   원더우먼  27     공주  데미스키라  178           NaN
4     헐크  33  핵물리학자     미국  270  1.000000e+09
5   캡틴마블  25    파일럿     미국  170  3.400000e+08
6  블랙위도우  32    스파이    러시아  170  5.000000e+07

In [50]:
ap.describe()

              나이           키            재산
count   7.000000    7.000000  5.000000e+00
mean   34.000000  189.857143  2.578000e+09
std    13.466007   35.983462  5.003441e+09
min    18.000000  170.000000  6.000000e+02
25%    26.000000  172.000000  5.000000e+07
50%    32.000000  177.000000  3.400000e+08
75%    39.000000  184.000000  1.000000e+09
max    58.000000  270.000000  1.150000e+10

In [52]:
ap['국적']

0       미국
1    아스가르드
2       미국
3    데미스키라
4       미국
5       미국
6      러시아
Name: 국적, dtype: object

In [54]:
type(ap['국적'])

pandas.core.series.Series

In [55]:
ap['국적'].unique()

array(['미국', '아스가르드', '데미스키라', '러시아'], dtype=object)

In [58]:
ap['국적'].value_counts()

국적
미국       4
아스가르드    1
데미스키라    1
러시아      1
Name: count, dtype: int64

In [59]:
ap['나이']

0    58
1    45
2    18
3    27
4    33
5    25
6    32
Name: 나이, dtype: int64

In [60]:
ap['나이'].nlargest(7)

0    58
1    45
4    33
6    32
3    27
5    25
2    18
Name: 나이, dtype: int64

In [61]:
ap.nlargest(3,'나이')

     이름  나이     직업     국적    키            재산
0  아이언맨  58    CEO     미국  174  1.150000e+10
1    토르  45      신  아스가르드  190           NaN
4    헐크  33  핵물리학자     미국  270  1.000000e+09